

#ifndef __DIAGMTAINTERFACE_H__
#define __DIAGMTAINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "PsTypeDef.h"


/*****************************************************************************
  2 宏定义
*****************************************************************************/
#if (FEATURE_ON == FEATURE_SC_SEC_UPDATE)
#define MTA_RSA_CIPHERTEXT_LEN      (256)
#else
#define MTA_RSA_CIPHERTEXT_LEN      (128)
#endif

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
 枚举名    : DIAG_MTA_MSG_TYPE_ENUM
 结构说明  : DIAG与MTA消息接口枚举

1.日    期  : 2016年09月6日
  作    者  : z00301431
  修改内容  : DIAG NV校验特性新增
*****************************************************************************/
enum DIAG_MTA_MSG_TYPE_ENUM
{
    /* 消息名称 */                      /* 消息ID */        /* 备注, 生成ASN */
    /* DIAG发给MTA的消息 */
    ID_DIAG_MTA_RSA_VERIFY_REQ          = 0x0001,

    /* MTA发给DIAG的消息 */
    ID_MTA_DIAG_RSA_VERIFY_CNF          = 0x1001,

    /* 最后一条消息 */
    ID_DIAG_MTA_MSG_TYPE_BUTT
};
typedef VOS_UINT32 DIAG_MTA_MSG_TYPE_ENUM_UINT32;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/
/*****************************************************************************
  5 消息头定义
*****************************************************************************/
/*****************************************************************************
  6 消息定义
*****************************************************************************/
/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
结构名    : DIAG_MTA_RSA_VERIFY_REQ_STRU
结构说明  : ID_DIAG_MTA_RSA_VERIFY_REQ消息结构体

1.日    期  : 2016年09月06日
  作    者  : z00301431
  修改内容  : DIAG NV校验特性新增
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    VOS_UINT32                          ulMsgId;                                /* 消息名 */
    VOS_UINT8                           aucSecString[MTA_RSA_CIPHERTEXT_LEN];   /* 安全校验密文 */
} DIAG_MTA_RSA_VERIFY_REQ_STRU;

/*****************************************************************************
 结构名    : MTA_DIAG_RSA_VERIFY_CNF_STRU
 结构说明  : ID_MTA_DIAG_RSA_VERIFY_CNF消息结构体

 1.日    期  : 2016年09月06日
   作    者  : z00301431
   修改内容  : DIAG NV校验特性新增
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    VOS_UINT32                          ulMsgId;                                /* 消息名 */
    VOS_UINT32                          ulVerifyRslt;                           /* 校验结果，PS_TRUE:成功，PS_FALSE:失败 */
}MTA_DIAG_RSA_VERIFY_CNF_STRU;

/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif


