

#ifndef __PSLOGFILTERINTERFACE_H__
#define __PSLOGFILTERINTERFACE_H__


/******************************************************************************
  1 其他头文件包含
******************************************************************************/
#include "vos.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


#pragma pack(4)


/******************************************************************************
  2 宏定义
******************************************************************************/

/******************************************************************************
  3 枚举定义
******************************************************************************/


/******************************************************************************
  4 全局变量声明
******************************************************************************/


/******************************************************************************
  5 消息头定义
******************************************************************************/


/******************************************************************************
  6 消息定义
******************************************************************************/


/******************************************************************************
  7 STRUCT定义
******************************************************************************/


/*****************************************************************************
 结构名    : PS_OM_LAYER_MSG_MATCH_PFUNC
 协议表格  :
 ASN.1描述 :
 结构说明  : MsgMatch回调函数指针
             此回调函数规则:
             1.如果注册回调内部没有对消息进行处理，则需要将入参指针返回，否则
               本模块不知道是否需要将此消息传递给下一个注册回调进行处理
             2.如果注册回调内部对消息进行了处理，则返回值能够实现两个功能:
               ①返回VOS_NULL，则将此消息进行完全过滤，不会再勾取出来
               ②返回与入参指针不同的另一个指针，则勾取的消息将会使用返回的指
                 针内容替换原消息的内容。另本模块不负责对替换的内存进行释放，
                 替换原消息使用的内存请各模块自行管理。
*****************************************************************************/
typedef VOS_VOID * (*PS_OM_LAYER_MSG_MATCH_PFUNC)(MsgBlock *pMsg);

/*****************************************************************************
 结构名    : PS_OM_CCPU_LAYER_MSG_FILTER_PFUNC
 协议表格  :
 ASN.1描述 :
 结构说明  : MsgFilter回调函数指针
 此回调函数规则:
             1.如果注册回调内部没有对消息进行处理，返回VOS_FALSE，否则
               本模块不知道是否需要将此消息传递给下一个注册回调进行处理
             2.如果注册回调内部对消息进行了处理，返回VOS_TRUE表示该消息
               需要进行过滤。
*****************************************************************************/
typedef VOS_UINT32 (*PS_OM_LAYER_MSG_FILTER_PFUNC)(const VOS_VOID *pMsg);


/******************************************************************************
  8 UNION定义
******************************************************************************/


/******************************************************************************
  9 OTHERS定义
******************************************************************************/

/*****************************************************************************
 函 数 名  : PS_OM_LayerMsgMatchInit
 功能描述  : A、C核初始化MsgMatch，向OM注册消息替换接口
            请注意,向底软注册接口只能注册一次:
             1、当前只有C核用到MsgMatch,在ttf模块向底软进行注册接口，
                其他模块请勿进行初始化操作；
             2、A核若需要用到MsgMatch，可以直接调用相关接口，需要
                进行初始化操作。
 输入参数  : VOS_VOID
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2016年9月3日
    作    者   : z00311339
    修改内容   : 新生成函数
*****************************************************************************/
VOS_VOID PS_OM_LayerMsgMatchInit(VOS_VOID);

/*****************************************************************************
 函 数 名  : PS_OM_LayerMsgMatchFuncReg
 功能描述  : A、C核注册MsgMatch回调接口:A核、C核均通过这个接口向MsgMatch模块
             注册过滤函数。
 输入参数  : PS_OM_LAYER_MSG_MATCH_PFUNC          pFunc
             输入参数回调接口规则:
             1.如果注册回调内部没有对消息进行处理，则需要将入参指针返回，否则
               本模块不知道是否需要将此消息传递给下一个注册回调进行处理
             2.如果注册回调内部对消息进行了处理，则返回值能够实现两个功能:
               ①返回VOS_NULL，则将此消息进行完全过滤，不会再勾取出来
               ②返回与入参指针不同的另一个指针，则勾取的消息将会使用返回的指
                 针内容替换原消息的内容。另本模块不负责对替换的内存进行释放，
                 替换原消息使用的内存请各模块自行管理。
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2016年9月5日
    作    者   : z00311339
    修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 PS_OM_LayerMsgMatchFuncReg
(
    PS_OM_LAYER_MSG_MATCH_PFUNC         pFunc
);

/*****************************************************************************
 函 数 名  : PS_OM_LayerMsgFilterInit
 功能描述  : A、C核初始化MsgFilter,向OM注册消息过滤接口
            请注意,向底软注册接口只能注册一次:
             1、C核在TLPS模块向底软进行注册接口,其他模块请勿进行初始化操作；
             2、A核在GUNAS模块向底软进行注册接口,其他模块请勿进行初始化操作.
 输入参数  : VOS_VOID
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2016年11月3日
    作    者   : z00383822
    修改内容   : 新生成函数
*****************************************************************************/
VOS_VOID PS_OM_LayerMsgFilterInit(VOS_VOID);

/*****************************************************************************
 函 数 名  : PS_OM_LayerMsgFilterFuncReg
 功能描述  : A、C核注册MsgFilter回调接口:A核、C核均通过这个接口向MsgFilter模块
             注册过滤函数。
 输入参数回调接口规则:
             1.如果注册回调内部没有对消息进行处理，返回VOS_FALSE，否则
               本模块不知道是否需要将此消息传递给下一个注册回调进行处理
             2.如果注册回调内部对消息进行了处理，返回VOS_TRUE表示该消息
               需要进行过滤
 输入参数  : PS_OM_LAYER_MSG_FILTER_PFUNC          pFunc
 输出参数  : 无
 返 回 值  : VOS_VOID
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2016年11月3日
    作    者   : z00383822
    修改内容   : 新生成函数

*****************************************************************************/
VOS_UINT32 PS_OM_LayerMsgFilterFuncReg
(
    PS_OM_LAYER_MSG_FILTER_PFUNC         pFunc
);



#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif


#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* PsLogFilterInterface.h */


